// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "Perangkat lunak ini harus dipasang pada media boot.";
"ERROR_INSTALL" = "Media ini tidak memenuhi syarat untuk pembaruan.";

"Newer_Package_Installed_message" = "Versi terbaru dari Chameleon sudah terpasang.";
"Intel_Mac_message" = "Perangkat lunak ini tidak dapat dipasang di komputer ini.";


// ============================================================================
// Install Type
// ----------------------------------------------------------------------------
"InstallType_title" = "Install Type";
"InstallType_description" = "Anda dapat memilih pemasangan baru atau meperbarui instalasi yang sudah ada.";

"New_title" = "New Installation";
"New_description" = "Menyimpan direktori Extra jika ditemukan di partisi tujuan. Direktori Extra akan dibuat jika ada opsi yang dipilih dari penginstall selain Bootloader.";

"Upgrade_title" = "Upgrade";
"Upgrade_description" = "Menggunakan direktori Extra jika ditemukan di partisi tujuan, jika ada opsi yang dipilih dari penginstall selain Bootloader.";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon";
"Chameleon_description" = "Chameleon memerlukan tiga berkas penting. (dalam kondisi sederhana)
boot0 (Pada drive MBR) bertanggung jawab dalam memuat boot1.
boot1 (Pada boot-sector partisi) untuk menemukan boot2.
boot2 (Pada root-folder partisi) untuk memuat kernel, dll.";

"Standard_title" = "Chameleon Standard";
"Standard_description" = "Opsi pemasangan ini memasang ketiga berkas penting dan membuat berkas boot0 ke 440 bytes pertama dari MBR, jadi tidak akan merusak bagian Sistem Operasi Windows. Kemudian boot0 mencari berkas boot1h pada partisi pertama yang aktif.
* Metode pemasangan ini mengaktifasi pilihan partisi yang anda sudah pilih.";

"EFI_title" = "EFI";
"EFI_description" = "Pasang berkas Chameleon ke partisi normal EFI yang tersembunyi Dengan menggunakan boot0 atau boot0md bergantung pada system anda tanpa menghapus partisi windows yang ada (jika tersedia).";

"noboot_title" = "Nihil";
"noboot_description" = "Tidak memasang Chameleon (berguna jika Anda hanya ingin memasang komponen tambahan)";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "Modul Chameleon";
"Module_description" = "The modules system incorporated in chameleon allows for a user or developer to extend the core functionality of chameleon without replacing the main boot file.";

"klibc_title" = "klibc";
"klibc_description" = "Modul ini menyediakan librari standar c kepada modul untuk menyambung jika librari yang disediakan oleh chameleon kurang memadai.
Biasanya digunakan oleh librari uClibc++.
Sumber: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Resolusi";
"AutoReso_description" = "Modul ini membaca informasi EDID dari monitor terpasang ke tampilan utama. Modul tidak langsung terintegrasi ke dalam bagasi 'trunk' dan telah digunakan seminimal mungkin pada saat dijalankan. Selain itu, modul akan patch mode vesa tersedia dalam pra intel hd kartu grafis untuk memberikan resolusi yang tepat saat booting.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "Modul ini menyediakan minimalisme librari runtime c++ untunk digunakan pada modul lainnya.
Modul ini tidak menyediakan fungsionalitas dengan sendirinya, melainkan digunakan untuk memungkinkan untuk bahasa c + + untuk dipakai dalam modul lainnya.
Perlu diketahui bahwa rtti dan exceptions keduanya sudah dinon-aktifkan.
Sumber: http://cxx.uclibc.org/
Ketergantungan: klibc";

"Keylayout_title" = "Keylayout";
"Keylayout_description" = "Module ini memperkenankan anda memapping keyboard sendiri.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Utility";
"Utility_description" = "Berkas tambahan untuk membantu pemasangan";

"PrefPanel_title" = "Preference Panel";
"PrefPanel_description" = "Memasang Panel Preferensi untuk Chameleon.";

"SMBIOS_title" = "SMBIOS.plist";
"SMBIOS_description" = "Menyalin contoh berkas smbios.plist di /Extra/Configuration.";

"Documentation_title" = "Dokumentasi";
"Documentation_description" = "Dokumentasi untuk pemasangan manual dan pemakaian Chameleon";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Opsi Boot";
"Options_description" = "Membuat berkas /Extra/com.apple.Boot.plist dan memilih pilihan anda untuk mengontrol pengaturan Chameleon anda.";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Menyembunyikan Judul pada tampilan awal Chameleon pada modus GUI.";

"GUI_title" = "GUI=No";
"GUI_description" = "Menonaktifkan GUI.";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Menggunakan logo asli apple (abu-abu pada latar belakang putih) pada saat proses booting daripada berkas boot.png yang ada pada tema.";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Menampilkan pilihan partisi tanpa adanya waktu time-out.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Mengaktifkan mode 'sunyi' (tanpa pesan ataupun pertanyaan).";

"ShowInfo_title" = "ShowInfo=Yes";
"ShowInfo_description" = "Menon-aktifkan rincian resolusi layar dan partisi.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Memberhentikan sejenak proses boot setelah Chameleon selesai mengatur konfigurasinya dan menunggu untuk tombol untuk ditekan sebelum memulai mach kernel. Berguna pada saat dikombinasikan dengan 'verbose boot' untuk memecahkan masalah.";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "Jalankan kernel dalam mode 32bit daripada mode biasanya (mode 64bit).";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "Mengaktifkan opsi untuk membetulkan semua isu kepemilikan EHCI yang dikarenakan BIOS yang rusak.";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "Mengaktifkan opsi dalam menambah ‘integrasi (built-in)’ ke perangkat ethernet anda.";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "Menghidupkan HPET pada chipset Intel, untuk BIOS yang tidak menyertakan opsi ini.";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "Opsi ini mengizinkan anda untuk melewati 'imaj tidur yang rusak'.";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Menonaktifkan perbaikan pada 'proses mulai-ulang secara otomatis.' ";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "Mengaktifkan opsi untuk mengatur-ulang pengontrol UHCI sebelum menyalakan OSX.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Mematikan opsi pengenalan RAM yang secara otomatis dinyalakan.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "Hanya untuk OSX Lion. Menyalakan loading of dari kernel yang sudah dilink. ini akan mengabaikan  /E/E and /S/L/E. gunakan ini JIKA anda telah mengetahui semua sudah mengandung yang anda perlukan.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Mencoba untuk memuat sleep image yang telah disimpan.";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "New - Generate C-States=Yes";
"CSTUsingSystemIO_description" = "C-State Baru! Metode generasi CST dengan menggunakan registrasi SystemIO daripada FixedHW.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Menghiraukan tabel SSDT motherboard yang terintegrasi.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Mengaktifkan bagian spesifik power Prosesor tertentu, C2.";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Mengaktifkan bagian spesifik power Prosesor tertentu, C3.";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Mengaktifkan bagian spesifik power Prosesor tertentu, C4.";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Mengaktifkan secara otomatis processor C-States.";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Mengaktifkan secara otomatis processor P-States.";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "Menset resolusi ke 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "Menset resolusi ke 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "Menset resolusi ke 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "Menset resolusi ke 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "Menset resolusi ke 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "Menset resolusi ke 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "Menset resolusi ke 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "Menset resolusi ke 1600x900x32";

"1600x1200x32_title" = "1600x1200x32";
"1600x1200x32_description" = "Menset resolusi ke 1600x1200x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "Menset resolusi ke 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "Menset resolusi ke 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "Menset resolusi ke 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Mengaktifkan opsi untuk mendeteksi otomatis GPU berbasis NVIDIA dan memasukkan info-info yang benar.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Mengaktifkan opsi 'Gunakan ROM ATi'.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Mengaktifkan opsi 'Gunakan ROM nVidia'.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Mengaktifkan opsi VBIOS.";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Verbose Mode";
"Verbose_description" = "Menyalakan modus terlampir (verbose) dari Chameleon dan kernel OS X kernel saat booting. Penting untuk penyelesaian masalah";

"Singleusermode_title" = "Single User Mode";
"Singleusermode_description" = "Modus opsi penyelesaian masalah dengan booting S X's BSD/Unix ke modus teks input.";

"Ignorecaches_title" = "Ignore Caches";
"Ignorecaches_description" = "Bukan merupakan opsi boot yang biasa digunakan sehari hari. Tapi sangat berguna jika anda ingin OS X meload semua berkas dari direktori system daripada yang sudah dicache pre-built.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "Mengatur bootflag npci=0x2000 pada opsi Kernel";

"Npci3_title" = "npci=0x3000";
"Npci3_description" = "Mengatur bootflag npci=0x3000 pada opsi Kernel";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Hanya untuk Lion. Mematikan fitur penyalaan rendah daya 'low power wake'yang dapat mengakibatkan layar gelap setelah komputer dalam posisi tidur.";


// ----------------------------------------------------------------------------
// Boot options - KEYMAPS
// ----------------------------------------------------------------------------

"mac-de_title" = "Mac Keyboard Jerman";
"mac-de_description" = "Menggunakan Mac keyboard Jerman";

"mac-es_title" = "keyboard  Mac Spanyol";
"mac-es_description" = "Menggunakan keyboard Mac Spanyol";

"mac-fr_title" = "keyboard  Mac Perancis";
"mac-fr_description" = "Menggunakan keyboard Mac Perancis";

"mac-it_title" = "keyboard  Mac Italia";
"mac-it_description" = "Menggunakan keyboard Mac Italia";

"mac-se_title" = "keyboard  Mac Swedia";
"mac-se_description" = "Menggunakan keyboard Mac Swedia";

"mac-pt_title" = "Portuguese Mac Keyboard";
"mac-pt_description" = "Use the keyboard layout for a Portuguese Mac keyboard";

"pc-de_title" = "German PC Keyboard";
"pc-de_description" = "Use the keyboard layout for a German PC keyboard";

"pc-es_title" = "Spanish PC Keyboard";
"pc-es_description" = "Use the keyboard layout for a Spanish PC keyboard";

"pc-fr_title" = "PC Keyboard Perancis";
"pc-fr_description" = "Menggunakan PC keyboard Perancis";

"pc-it_title" = "Italian PC Keyboard";
"pc-it_description" = "Use the keyboard layout for a Italian PC keyboard";

"pc-se_title" = "Swedish PC Keyboard";
"pc-se_description" = "Use the keyboard layout for a Swedish PC keyboard";

"pc-pt_title" = "Portuguese PC Keyboard";
"pc-pt_description" = "Use the keyboard layout for a Portuguese PC keyboard";

// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "Versi simple yang lebih kecil daripada tema dasar yang baru digunakan para seat membuat versi dari Chameleon yang dimana memerlukan sebuah tema yang 'embedded'. ";

"Legacy_title" = "Legacy";
"Legacy_description" = "Tampilan dasar awal Chameleon";

"Default_title" = "Standard";
"Default_description" = "Tampilan dasar baru Chameleon.";

"Bullet_title" = "Bullet";
"Bullet_description" = "Tema yang cantik dan simple dari NoSmokingBandit sejak April 2009.";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Opsi Kontrol";
"Control_description" = "Setting untuk mengotrol kerja Chameleon.";

// General
"General_title" = "Opsi umum";
"General_description" = "Pemilihan setting umum.";

// KernelFlags
"KernelFlags_title" = "Opsi Kernel";
"KernelFlags_description" = "Pilihan seleksi opsi kernel.";

// PowerManagement
"PowerManagement_title" = "Manajemen Daya";
"PowerManagement_description" = "Pilihan yang berhubungan dengan manajemen daya prosesor dan perubahan kecepatan prosesor otomatis (speedstep).";

// Resolution
"Resolution_title" = "Resolusi";
"Resolution_description" = "Set one resolution to use.";

// Video
"Video_title" = "Video";
"Video_description" = "Opsi seleksi untuk video.";

// Keymaps
"Keymaps_title" = "Layout keyboard";
"Keymaps_description" = "Select one keylayout to use. This will also install the Keylayout module and keymaps.";

// Themes
"Themes_title" = "Tema";
"Themes_description" = "Koleksi dari tema bawaan
More themes can be found at http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "None";
"ChooseNone-Resolution_description" = "Jangan pilih resolusi.";

"ChooseNone-keylayout_title" = "None";
"ChooseNone-keylayout_description" = "Jangan pilih layout keyboard.";
